---
title: Лабораторная работа 4
tags:
  - programming-workshop
  - lab
  - cxx
---
## Задание
Дана $f$ - рядная функция, есть $F$ - функция, взятая из стандартной математической библиотеки.
Необходимо:
- Вывести рекуррентную форму приращения данной рядной функции
- Написать программу для вычисления значения рядной и библиотечной функции
- Вычислить невязку $\delta$ (дельту) значений рядной функции и стандартной библиотечной функций по формуле: $$\delta = \sqrt{|f^{2(x)}- F^2(x)|}$$
Вычисления ряда производить до условия минимизации значения разности двух соседних членов ряда меньше заданного $\epsilon$  по формуле: $$|f_k(x)-f_{k-1}(x)| < \epsilon$$
Ряд рассчитывать по рекуррентной формуле расчета ряда.
## Исходные данные 
$$\pi x =\frac{1}{\pi x}+\frac{2x}{\pi}\sum_{k=1}^{+\inf}\frac{1}{x^2-k^2}$$

## Исходный код
#### CMake
```cmake
cmake_minimum_required(VERSION 3.0.0)  
project(lab4  
  DESCRIPTION "Лабораторная работа 4"  
  HOMEPAGE_URL "github.com/whs31/education"  
  LANGUAGES CXX  
)  
  
set(CMAKE_CXX_STANDARD 20)  
  
add_executable(${PROJECT_NAME})  
target_sources(${PROJECT_NAME} PRIVATE main.cc)  
target_include_directories(${PROJECT_NAME} PRIVATE ${CMAKE_CURRENT_SOURCE_DIR})
```

#### C++
```cpp
/*
 * Лабораторная работа 3
 * Студент: Рязанцев Дмитрий
 */

#include <iostream>
#include <format>
#include <memory>
#include <tuple>
#include <random>

namespace terminal::colors
{
  using namespace std::literals;

  auto constexpr yellow = "\x1b[33m"sv;
  auto constexpr green = "\x1b[32m"sv;
  auto constexpr reset = "\x1b[0m"sv;
}

auto main() -> int
{
  using std::cin;
  using std::cout;
  using std::cerr;
  using std::endl;

  auto const [rows, columns] = []() -> std::tuple<int, int> {
    auto r = 0, c = 0;
    cout << "Enter rows count:" << endl;
    cin >> r;
    cout << "\nEnter columns count:" << endl;
    cin >> c;
    if(r <= 0 or c <= 0 or cin.fail()) {
      cerr << "Invalid dimensions" << endl;
      std::exit(1);
    }
    return { r, c };
  }();

  auto rd = std::random_device();
  auto gen = std::mt19937(rd());
  auto distrib = std::uniform_int_distribution<>(0, 100);
  auto matrix = std::make_unique<int[]>(rows * columns);
  for(auto i = 0; i < rows * columns; ++i)
    matrix[i] = distrib(gen);
    
  auto print_matrix = [&]{
    for(auto i = 0; i < rows; ++i) {
      for(auto j = 0; j < columns; ++j)
        cout << std::format("{:<3} ",matrix[i * columns + j]);
      cout << endl;
    }
  };

  cout << std::format("\n\nInitial matrix of size {}x{}: {}\n", rows, columns, terminal::colors::yellow);
  print_matrix();

  // make all elements above the main diagonal zero
  for(auto i = 0; i < rows; ++i)
    for(auto j = 0; j < columns; ++j)
      if(i < j)
        matrix[i * columns + j] = 0;
  cout << std::format("\n\nMatrix with zeros above the main diagonal: {}\n", terminal::colors::green);
  print_matrix();
  cout << terminal::colors::reset << "\nDone!" << endl;

  return 0;
}
```
